/*let w =  confirm (`Բարի գալուստ ով է ուզում դառնալ միլոնատեր խաղ
Խաղի կանոնները
Խաղն ունի 15 հարց։ Ամեն մի հարց ունի 4 տարբերակ, որից միայն մեկն է ճիշտ, մասնակիցը պարտավոր է ընտրել 4 տարբերակից միայն 1 ճիշտ տարբերակը, որը նրան կբերի գումար։

Նկարագրություն
Խաղը բաղկացած է 5 փուլից, որից ամեն մի փուլը բաղկացած է 5 հարցից։ Առաջին փուլում մասնակիցը ունենում է 3 օգնության հնարավորություն.

Դահլիճի օգնություն - Երբ որ մասնակիցը դժվարանում է հարցին պատասխանել նա օգտվում է դահլիճի օգնությունից։ Դահլիճում գտնվող բոլոր անձինք իրենց 
հնարավորությունների սահմաններում տարբերակներից մեկին փորձում են պատասխանել ճիշտ։ Բոլոր անձանց տրվում են վահանակներ, որոնց շնորհիվ էլ կարողանում են ընտրել ճիշտ պատասխանը։
50:50 - համակարգիչը ջնջում է 4 տարբերակներից 2 սխալ տարբերակները, իսկ այդ 2 տարբերակներից 1-ը մասնակիցը պարտավոր է ընտրել 1 ճիշտ պատասխանը։
Զանգ ընկերոջը- Մասնակցին տրվում է 30 վայրկյան, որի ընթացքում մասնակիցը պետք է ընթերցի հարցը իր զանգընկերոջը, իսկ 30 վայրկյանից հետո զանգն ընթատվում է։
2-րդ փուլից սկսած ավելանում է ևս 1 օգնության հնարավորություն.

Հարցը փոխել - մասնակիցը կարող է խաղի ընթացքում մեկ անգամ փոխել հարցը։ `)

function* milloner() {

    let question = yield "Ո՞ր օրն է համարվում շաբաթվա առաջին օրը Իսրայելում"
    
    point = 0;
    if (answer === "կիրակի" ) {
        confirm("դուք վաստակել եք 1000 դրամ")
       confirm ("պատասխանը ճիշտ է")
    }else if(answer !== "երկուշաբթի" && answer!== "ուրբաթ" && answer!== "շաբաթ"){
        confirm("դուք վաստակել եք 0 դրամ")
        confirm("պատասխանը սխալ է")
    } else  {

        return
    }


    let NextQuestion = yield "Ո՞ր քիմիական տարրի հայտնագործման պատվին են Ֆրանսիայում 19-րդ դարում հատել Ապոլոնի պատկերով մեդալ․"
    
    point++
    if (answer1 === "հելիում" ) {
        confirm("դուք վաստակել եք 5000 դրամ")
        confirm ("պատասխանը ճիշտ է")
       


    } else if(answer1 !== "տիտան" && answer1!== "ջրածին" && answer1!== "ջրածին"){
        confirm("դուք վաստակել եք 0 դրամ")
        confirm("պատասխանը սխալ է")
    } else  {

        return
    }
    let NextQuestion1 = yield "Ըստ իր խոստովանության ինչի՞ աստվածն էր Օլե Լուկոյեն՝ Անդերսենի համանուն հեքիաթից"
    if (answer2 === "երազների") {
        point++
        confirm("դուք վաստակել եք 10000 դրամ")
        confirm ("պատասխանը ճիշտ է")
       


    } else if(answer2 !== "գիշերվա" && answer2!== "հեքիաթներ" && answer2!== "մանկություն"){
        confirm("դուք վաստակել եք 0 դրամ")
        confirm("պատասխանը սխալ է")
    } else  {

        return
    }

}
let game = milloner();
let question = game.next();
let answer = prompt(question.value);
let NextQuestion = game.next(+answer);
if (NextQuestion.done) {
    console.log("Came over ")

} else {
    prompt(NextQuestion.value);

}*/

document.body.style.background = "red"
setTimeout(()=>document)